setup.org
#+TITLE: Setup
#+OPTIONS: toc:nil num:nil

* Introduction

This page will highlight the ~build-script.el~ used to generate this website. This entire website is generated through org files using the command:

#+BEGIN_SRC bash
emacs -Q --script build-site.el
#+END_SRC

