output/setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Setup</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css" />
<link rel="stylesheet" href="style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a href="/">Home | </a>
  <a href="/posts/posts-list.html">Posts | </a>
  <a href="/blogs/blogs-list.html">Blogs | </a>
  <a href="/contact.html">Contact</a>
</nav>
<div id="updated">Updated: 2025-08-07 Thu 22:36</div>
</div>
<div id="content" class="content">
<h1 class="title">Setup</h1>
<div id="outline-container-org829abdc" class="outline-2">
<h2 id="org829abdc">Introduction</h2>
<div class="outline-text-2" id="text-org829abdc">
<p>
This page will highlight the <code>build-script.el</code> used to generate this website. This entire website is generated through org files using the command:
</p>

<div class="org-src-container">
<pre class="src src-bash">emacs -Q --script build-site.el
</pre>
</div>
</div>
</div>
