output/setup.html
<div id="outline-container-orgb9cb047" class="outline-2">
<h2 id="orgb9cb047">The script</h2>
<div class="outline-text-2" id="text-orgb9cb047">
<p>
The script is as follows, at the start I have commented out pieces of code (somewhat relevant to the script but never really used), followed by package management. Then there's the declaration of variables and functions and finally the <code>org-publish-project-alist</code> which handles nearly all of the project generation instructions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span class="org-comment-delimiter">;; </span><span class="org-comment">Commented out things:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(defvar z-head
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"https://gongzhitaao.org/orgcss/org.css\" /&gt;
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">&lt;link rel=\"stylesheet\" href=\"/style.css\" /&gt;")
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-html-validation-link nil
</span><span class="org-comment-delimiter">;;       </span><span class="org-comment">org-html-head-include-scripts nil
</span><span class="org-comment-delimiter">;;       </span><span class="org-comment">org-html-head-include-default-style nil
</span><span class="org-comment-delimiter">;;       </span><span class="org-comment">org-html-head z-head)
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(type-of (car '(rose violet daisy buttercup)))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(cadr (assoc "FILETAGS" (org-collect-keywords '("FILETAGS"))))
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(let ((list '(("post1.org") ("post2.org"))))
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(mapconcat (lambda (entry)
</span><span class="org-comment-delimiter">;;                </span><span class="org-comment">(format "- [[file:%s]]" (car entry)))
</span><span class="org-comment-delimiter">;;              </span><span class="org-comment">list
</span><span class="org-comment-delimiter">;;              </span><span class="org-comment">"\n"))
</span>


<span class="org-comment-delimiter">;;</span><span class="org-comment">BEGIN:
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Set the package installation directory so that packages aren't stored in the
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">~/.emacs.d/elpa path.
</span>(<span class="org-keyword">require</span> '<span class="org-constant">package</span>)
(<span class="org-keyword">setq</span> package-user-dir (expand-file-name <span class="org-string">"./.packages"</span>))
(<span class="org-keyword">setq</span> package-archives '((<span class="org-string">"melpa"</span> . <span class="org-string">"https://melpa.org/packages/"</span>)
                         (<span class="org-string">"elpa"</span> . <span class="org-string">"https://elpa.gnu.org/packages/"</span>)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Initialize the package system
</span>(package-initialize)
(<span class="org-keyword">unless</span> package-archive-contents
  (package-refresh-contents))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Install dependencies
</span>(package-install 'htmlize)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Load the publishing system
</span>(<span class="org-keyword">require</span> '<span class="org-constant">ox-publish</span>)
(<span class="org-keyword">setq</span> org-html-htmlize-output-type 'css)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">z-preamble</span>
  <span class="org-string">"&lt;nav&gt;
  &lt;a href=\"/\"&gt;Home | &lt;/a&gt;
  &lt;a href=\"/posts/posts-list.html\"&gt;Posts | &lt;/a&gt;
  &lt;a href=\"/blogs/blogs-list.html\"&gt;Blogs | &lt;/a&gt;
  &lt;a href=\"/contact.html\"&gt;Contact&lt;/a&gt;
&lt;/nav&gt;
&lt;div id=\"updated\"&gt;Updated: %C&lt;/div&gt;"</span>
)

(<span class="org-keyword">defvar</span> <span class="org-variable-name">z-postamble</span>
  <span class="org-string">"&lt;footer&gt;
&lt;div class=\"copyright-container\"&gt;
&lt;div class=\"copyright\"&gt;
Copyright &amp;copy; 2022-2025 Zaine Qayyum. All rights reserved unless otherwise noted.&lt;/div&gt;&lt;/div&gt;
&lt;div class=\"generated\"&gt;
Created with %c on &lt;a href=\"https://www.archlinux.org/\"&gt;Arch&lt;/a&gt; &lt;a href=\"https://www.gnu.org\"&gt;GNU&lt;/a&gt;/&lt;a href=\"https://www.kernel.org/\"&gt;Linux&lt;/a&gt;
&lt;/div&gt;
&lt;/footer&gt;"</span>)



(<span class="org-keyword">defun</span> <span class="org-function-name">z/posts-sitemap</span> (title list)
  <span class="org-doc">"sitemap that lists post links as bullet points with dates and tags."</span>
  (concat
   <span class="org-string">"#+TITLE: "</span> title <span class="org-string">"\n"</span>
   <span class="org-string">"#+OPTIONS: toc:nil num:nil \n\n"</span>
   <span class="org-string">"* Posts:\n"</span>
   (mapconcat
    (<span class="org-keyword">lambda</span> (entry)
      (<span class="org-keyword">let*</span> ((link (car entry))
             <span class="org-comment-delimiter">;; </span><span class="org-comment">extract relative file name from the link
</span>             (filename (<span class="org-keyword">if</span> (string-match <span class="org-string">"\\[\\[file:</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">]]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]"</span> link)
                           (match-string 1 link)
                         link))
             (full-path (expand-file-name filename <span class="org-string">"~/master-folder/org_files/org_web/posts/"</span>))
             (date-str <span class="org-string">"no date"</span>)
             (tags-str <span class="org-string">""</span>))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Get publish date
</span>        (<span class="org-keyword">let</span> ((date (org-publish-find-date full-path org-publish-project-alist)))
          (<span class="org-keyword">when</span> date
            (<span class="org-keyword">setq</span> date-str (format-time-string <span class="org-string">"%Y-%m-%d"</span> date))))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Get FILETAGS from file buffer
</span>        (<span class="org-keyword">when</span> (file-exists-p full-path)
          (<span class="org-keyword">with-temp-buffer</span>
            (insert-file-contents full-path)
            (org-mode)
            (<span class="org-keyword">let*</span> ((tags (cadr (assoc <span class="org-string">"FILETAGS"</span> (org-collect-keywords '(<span class="org-string">"FILETAGS"</span>))))))
              (<span class="org-keyword">when</span> tags
                (<span class="org-keyword">setq</span> tags-str (mapconcat (<span class="org-keyword">lambda</span> (tag)
                                            (format <span class="org-string">"@@html:&lt;span class=\"post-tag\"&gt;%s&lt;/span&gt;@@"</span> tag))
                                          (split-string tags <span class="org-string">":"</span> t)  <span class="org-comment-delimiter">;; </span><span class="org-comment">&lt;- Splits by ":" and removes empty strings
</span>                                          <span class="org-string">" "</span>))))))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Final line output
</span>        (format <span class="org-string">"- %s @@html:&lt;span class=\"post-date\"&gt;%s&lt;/span&gt;@@ %s"</span> link date-str tags-str)))
    (cdr list)
    <span class="org-string">"\n"</span>)))


(<span class="org-keyword">defun</span> <span class="org-function-name">z/blogs-sitemap</span> (title list)
  <span class="org-doc">"sitemap that lists blog links as bullet points with dates and tags."</span>
  (concat
   <span class="org-string">"#+TITLE: "</span> title <span class="org-string">"\n"</span>
   <span class="org-string">"#+OPTIONS: toc:nil num:nil \n\n"</span>
   <span class="org-string">"* Posts:\n"</span>
   (mapconcat
    (<span class="org-keyword">lambda</span> (entry)
      (<span class="org-keyword">let*</span> ((link (car entry))
             <span class="org-comment-delimiter">;; </span><span class="org-comment">extract relative file name from the link
</span>             (filename (<span class="org-keyword">if</span> (string-match <span class="org-string">"\\[\\[file:</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">]]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]"</span> link)
                           (match-string 1 link)
                         link))
             (full-path (expand-file-name filename <span class="org-string">"~/master-folder/org_files/org_web/blogs/"</span>))
             (date-str <span class="org-string">"no date"</span>)
             (tags-str <span class="org-string">""</span>))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Get publish date
</span>        (<span class="org-keyword">let</span> ((date (org-publish-find-date full-path org-publish-project-alist)))
          (<span class="org-keyword">when</span> date
            (<span class="org-keyword">setq</span> date-str (format-time-string <span class="org-string">"%Y-%m-%d"</span> date))))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Get FILETAGS from file buffer
</span>        (<span class="org-keyword">when</span> (file-exists-p full-path)
          (<span class="org-keyword">with-temp-buffer</span>
            (insert-file-contents full-path)
            (org-mode)
            (<span class="org-keyword">let*</span> ((tags (cadr (assoc <span class="org-string">"FILETAGS"</span> (org-collect-keywords '(<span class="org-string">"FILETAGS"</span>))))))
              (<span class="org-keyword">when</span> tags
                (<span class="org-keyword">setq</span> tags-str (mapconcat (<span class="org-keyword">lambda</span> (tag)
                                            (format <span class="org-string">"@@html:&lt;span class=\"post-tag\"&gt;%s&lt;/span&gt;@@"</span> tag))
                                          (split-string tags <span class="org-string">":"</span> t)  <span class="org-comment-delimiter">;; </span><span class="org-comment">&lt;- Splits by ":" and removes empty strings
</span>                                          <span class="org-string">" "</span>))))))
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Final line output
</span>        (format <span class="org-string">"- %s @@html:&lt;span class=\"post-date\"&gt;%s&lt;/span&gt;@@ %s"</span> link date-str tags-str)))
    (cdr list)
    <span class="org-string">"\n"</span>)))


<span class="org-comment-delimiter">;; </span><span class="org-comment">Define the publishing project
</span>(<span class="org-keyword">setq</span> org-publish-project-alist
      `((<span class="org-string">"org-notes"</span>
         <span class="org-builtin">:recursive</span> t
         <span class="org-builtin">:base-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/"</span>
         <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
         <span class="org-builtin">:publishing-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/output"</span>
         <span class="org-builtin">:with-author</span> nil
         <span class="org-builtin">:with-creator</span> t
         <span class="org-builtin">:with-toc</span> t
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:section-numbers</span> nil
         <span class="org-builtin">:time-stamp-file</span> nil
         <span class="org-builtin">:html-preamble</span> ,z-preamble
         <span class="org-builtin">:html-postamble</span> ,z-postamble
         <span class="org-builtin">:html-head</span> <span class="org-string">"
&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"https://gongzhitaao.org/orgcss/org.css\" /&gt;
&lt;link rel=\"stylesheet\" href=\"style.css\" /&gt;
&lt;script src=\"script.js\" defer&gt;&lt;/script&gt;
"</span>
        )
        (<span class="org-string">"org-posts"</span>
         <span class="org-builtin">:base-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/posts"</span>
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:publishing-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/output/posts/"</span>
         <span class="org-builtin">:recursive</span> t
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
         <span class="org-builtin">:with-author</span> nil
         <span class="org-builtin">:with-creator</span> nil
         <span class="org-builtin">:html-validation-link</span> nil
         <span class="org-builtin">:with-toc</span> t
         <span class="org-builtin">:section-numbers</span> t
         <span class="org-builtin">:html-preamble</span> ,z-preamble
         <span class="org-builtin">:html-postamble</span> ,z-postamble
         <span class="org-builtin">:auto-sitemap</span> t
         <span class="org-builtin">:sitemap-filename</span> <span class="org-string">"posts-list.org"</span>
         <span class="org-builtin">:sitemap-title</span> <span class="org-string">"Posts List"</span>
         <span class="org-builtin">:sitemap-style</span> list
         <span class="org-builtin">:sitemap-function</span> z/posts-sitemap
         <span class="org-builtin">:html-head</span> <span class="org-string">"
&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"https://gongzhitaao.org/orgcss/org.css\" /&gt;
&lt;link rel=\"stylesheet\" href=\"../style.css\" /&gt;
&lt;script src=\"../script.js\" defer&gt;&lt;/script&gt;
"</span>
         )
        (<span class="org-string">"org-blogs"</span>
         <span class="org-builtin">:base-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/blogs"</span>
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:publishing-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/output/blogs/"</span>
         <span class="org-builtin">:recursive</span> t
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
         <span class="org-builtin">:with-author</span> nil
         <span class="org-builtin">:with-creator</span> nil
         <span class="org-builtin">:html-validation-link</span> nil
         <span class="org-builtin">:with-toc</span> t
         <span class="org-builtin">:section-numbers</span> t
         <span class="org-builtin">:html-preamble</span> ,z-preamble
         <span class="org-builtin">:html-postamble</span> ,z-postamble
         <span class="org-builtin">:auto-sitemap</span> t
         <span class="org-builtin">:sitemap-filename</span> <span class="org-string">"blogs-list.org"</span>
         <span class="org-builtin">:sitemap-title</span> <span class="org-string">"Blogs List"</span>
         <span class="org-builtin">:sitemap-style</span> list
         <span class="org-builtin">:sitemap-function</span> z/blogs-sitemap
         <span class="org-builtin">:html-head</span> <span class="org-string">"
&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"https://gongzhitaao.org/orgcss/org.css\" /&gt;
&lt;link rel=\"stylesheet\" href=\"../style.css\" /&gt;
&lt;script src=\"../script.js\" defer&gt;&lt;/script&gt;
"</span>
         )


        (<span class="org-string">"org-assets"</span>
         <span class="org-builtin">:base-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/assets/"</span>
         <span class="org-builtin">:base-extension</span> <span class="org-string">"css</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">js</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">png</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">jpg</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">gif</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">svg</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">pdf</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">woff</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">woff2</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">ttf"</span>
         <span class="org-builtin">:publishing-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/output/assets/"</span>
         <span class="org-builtin">:recursive</span> t
         <span class="org-builtin">:publishing-function</span> org-publish-attachment)
        (<span class="org-string">"org-static"</span>
         <span class="org-builtin">:base-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/"</span>
         <span class="org-builtin">:base-extension</span> <span class="org-string">"css</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">js"</span>
         <span class="org-builtin">:publishing-directory</span> <span class="org-string">"~/master-folder/org_files/org_web/output"</span>
         <span class="org-builtin">:recursive</span> t
         <span class="org-builtin">:publishing-function</span> org-publish-attachment)

        (<span class="org-string">"website"</span>
         <span class="org-builtin">:components</span> (<span class="org-string">"org-notes"</span> <span class="org-string">"org-assets"</span> <span class="org-string">"org-posts"</span> <span class="org-string">"org-blogs"</span> <span class="org-string">"org-static"</span>))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Delete the output before generating the new one
</span>(delete-directory <span class="org-string">"~/master-folder/org_files/org_web/output/"</span> t)
(message <span class="org-string">"Directory deleted"</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Generate the site output
</span>(org-publish-all t)

(message <span class="org-string">"Build complete!"</span>)

</pre>
</div>
</div>
</div>
